In [1]:
import numpy as np
import pandas as pd

In [16]:
pd.DataFrame(data=np.random.rand(5,4),index=['a','b','c','d','e'],columns=[1,2,3,4])

          1         2         3         4
a  0.972089  0.801003  0.997256  0.486855
b  0.937062  0.288688  0.749210  0.327775
c  0.083945  0.250064  0.791069  0.921257
d  0.767093  0.697256  0.597394  0.993545
e  0.377986  0.866916  0.858241  0.144696

In the above 1,2,3,4 are all pandas Series with a common index

In [17]:
df = pd.DataFrame(data=np.random.rand(5,4),index=['a','b','c','d','e'],columns=[1,2,3,4])

In [18]:
df[2]

a    0.344175
b    0.903776
c    0.638131
d    0.346336
e    0.730725
Name: 2, dtype: float64

In [28]:
df[[1,3]]

          1         3
a  0.469217  0.095023
b  0.386652  0.966709
c  0.102662  0.685779
d  0.164284  0.902720
e  0.176588  0.113209

In [29]:
df[5]=df[3]+df[1]

In [30]:
df

          1         2         3         4         5
a  0.469217  0.344175  0.095023  0.741072  0.564240
b  0.386652  0.903776  0.966709  0.345981  1.353361
c  0.102662  0.638131  0.685779  0.517034  0.788441
d  0.164284  0.346336  0.902720  0.036622  1.067005
e  0.176588  0.730725  0.113209  0.314162  0.289797

In [32]:
df.drop(5, axis=1)

          1         2         3         4
a  0.469217  0.344175  0.095023  0.741072
b  0.386652  0.903776  0.966709  0.345981
c  0.102662  0.638131  0.685779  0.517034
d  0.164284  0.346336  0.902720  0.036622
e  0.176588  0.730725  0.113209  0.314162

axis=0 means rows
axis=1 means columns

In [33]:
df

          1         2         3         4         5
a  0.469217  0.344175  0.095023  0.741072  0.564240
b  0.386652  0.903776  0.966709  0.345981  1.353361
c  0.102662  0.638131  0.685779  0.517034  0.788441
d  0.164284  0.346336  0.902720  0.036622  1.067005
e  0.176588  0.730725  0.113209  0.314162  0.289797

df.drop will not drop in place. Need to use inplace argument

In [34]:
df2 = df.drop(5, axis=1)

In [35]:
df2

          1         2         3         4
a  0.469217  0.344175  0.095023  0.741072
b  0.386652  0.903776  0.966709  0.345981
c  0.102662  0.638131  0.685779  0.517034
d  0.164284  0.346336  0.902720  0.036622
e  0.176588  0.730725  0.113209  0.314162

In [36]:
df2[4]=pd.Series([1,2,3,4,5],['a','b','c','d','e'])

In [37]:
df2

          1         2         3  4
a  0.469217  0.344175  0.095023  1
b  0.386652  0.903776  0.966709  2
c  0.102662  0.638131  0.685779  3
d  0.164284  0.346336  0.902720  4
e  0.176588  0.730725  0.113209  5

In [38]:
df

          1         2         3         4         5
a  0.469217  0.344175  0.095023  0.741072  0.564240
b  0.386652  0.903776  0.966709  0.345981  1.353361
c  0.102662  0.638131  0.685779  0.517034  0.788441
d  0.164284  0.346336  0.902720  0.036622  1.067005
e  0.176588  0.730725  0.113209  0.314162  0.289797

In [42]:
df.drop(5, axis=1, inplace=True)

In [43]:
df

          1         2         3         4
a  0.469217  0.344175  0.095023  0.741072
b  0.386652  0.903776  0.966709  0.345981
c  0.102662  0.638131  0.685779  0.517034
d  0.164284  0.346336  0.902720  0.036622
e  0.176588  0.730725  0.113209  0.314162

In [45]:
df.drop('e')

          1         2         3         4
a  0.469217  0.344175  0.095023  0.741072
b  0.386652  0.903776  0.966709  0.345981
c  0.102662  0.638131  0.685779  0.517034
d  0.164284  0.346336  0.902720  0.036622

In [46]:
df

          1         2         3         4
a  0.469217  0.344175  0.095023  0.741072
b  0.386652  0.903776  0.966709  0.345981
c  0.102662  0.638131  0.685779  0.517034
d  0.164284  0.346336  0.902720  0.036622
e  0.176588  0.730725  0.113209  0.314162

In [47]:
df.shape

(5, 4)

In [56]:
df[[2,3]].loc[['b','d']]

          2         3
b  0.903776  0.966709
d  0.346336  0.902720

In [74]:
df[[2]]

          2
a  0.344175
b  0.903776
c  0.638131
d  0.346336
e  0.730725

In [75]:
df.loc['b']

1    0.386652
2    0.903776
3    0.966709
4    0.345981
Name: b, dtype: float64

In [76]:
df.loc[['b']]

          1         2         3         4
b  0.386652  0.903776  0.966709  0.345981

In [77]:
df.iloc[2]

1    0.102662
2    0.638131
3    0.685779
4    0.517034
Name: c, dtype: float64

In [78]:
df.iloc[2:]

          1         2         3         4
c  0.102662  0.638131  0.685779  0.517034
d  0.164284  0.346336  0.902720  0.036622
e  0.176588  0.730725  0.113209  0.314162

In [79]:
df.loc['c',2]

0.6381306709964654

In [82]:
df.loc[['a','b'], df.columns>2]

          3         4
a  0.095023  0.741072
b  0.966709  0.345981